"""
Напишите программу, которая принимает на вход цифру,
обозначающую день недели, и проверяет, является ли этот день выходным.
"""

day = input('Enter number: ')
print(day == '6' or day == '7')
