"""
Напишите программу, которая определит позицию второго вхождения строки в списке илисообщит, что ее нет
lst = ['qwe', 'asd,' 'zxc,' 'qwe', 'ertqwe']
lst = ['йцу', 'фыв', 'ячс', 'цук', 'йцукен', 'йцу']
lst = ['йцу', 'фыв', 'ячс', 'цук', 'йцукен']
lst = ['123', '234', '567', 123]
lst = []
"""
lst = ['йцу', 'фыв', 'ячс', 'цук', 'йцукен', 'йцу']
find = 'йцу'
count = 0
index = -1
for i in range(len(lst)):
    # print(i)
    if lst[i] == find:
        count += 1
        if count == 2:
            index = i
            break

print(index)
